{"intents": [
        {"tag": "greetings",
         "patterns": ["hi", 
                      "how are you", 
                      "is anyone there", 
                      "hello", 
                      "whats up",
                      "hey",
                      "yo",
                      "listen", 
                      "please help me",
                      "i belong to",
                      "aiml batch",
                      "i am from",
                      "my name is",
                      "online",
                      "i am from",
                      "hey ya",
                      "talking to you for first time"], 
					   
         "responses": ["Hello! how could i help you?",
					  "Hi there! How may i help you please?",
					  "Hello! How do you do? How could i help you today?"], 
					  
         "context_set": ""
        },
        {"tag": "sendoff",
         "patterns": ["thank you", 
                      "thanks", 
                      "cya",
					  "bye",
                      "see you",
                      "later", 
                      "see you later", 
                      "goodbye", 
                      "i am leaving", 
                      "have a Good day",
                      "you helped me",
                      "thanks a lot",
                      "thanks a ton",
                      "you are the best",
                      "great help",
                      "too good",
                      "you are a good learning buddy"],
					  
         "responses": ["I hope I was able to assist you, Good Bye"],
		 
         "context_set": ""
        },
        {"tag": "rude",
         "patterns": ["what the hell",
                      "bloody stupid bot",
                      "do you think you are very smart",
                      "screw you", 
                      "i hate you", 
                      "you are stupid",
                      "jerk",
                      "you are a joke",
                      "useless piece of shit"],
         "responses": ["Please use respectful words"],
         "context_set": ""
        },
        {"tag": "Bot",
         "patterns": ["what is your name",
                      "who are you",
                      "name please",
                      "when are your hours of opertions", 
                      "what are your working hours", 
                      "hours of operation",
                      "working hours",
                      "hours"],
         "responses": ["I am your virtual learning assistant"],
         "context_set": ""
        },    
		{"tag": "MiningEmployee",
         "patterns": ["What causes accidents in Mining of employee type?",
					  "What are Major Reason of accidents in Mining?",
					  "Is it a polyurethane pulley protective lyner installation issue?",
					  "Does Piping issue a major cause of accidents?",
					  "Does Pumping issue a major cause of accidents?",
					  "Does Installation issues a major cause of accidents?",
					  "Is lack of Inspection a major cause of accidents?",
					  "Does rock block displacement issues a major cause of accidents?",
					  "Are major accidents happening during drilling?",
					  "Are major accidents happening during Equipment cleaning?"],
         "responses": ["In MiningEmployee type, Workers lack of attention and ignorance on daily duties during blasting drilling and bad installation of segments causing locomotive failures but not any other reason"],
         "context_set": ""
        },    
        {"tag": "MetalsThirdPartyRemote",
         "patterns": ["What causes accidents in Metals of Third Party Remote employee type",
					  "What are Major Reason of accidents in Metals?",
					  "Are Chemical substances a major cause of accidents?",
					  "Are Pressurized systems a major cause of accidents?",
					  "Are Manual Tools a major cause of accidents?",
					  "Lack of experience in Bladding a major cause of accidents?",
					  "Lack of experience in Carpentry a major cause of accidents?",
					  "Is Falling down cause major injuries?",
					  "Are Blockages a major cause of accidents?",
					  "Lack of experience in Unhooking a major cause of accidents?",
					  "Lack of experience in Unloading causes majority of accidents?"],
         "responses": ["In MetalsThirdPartyRemote type, Pressure systems and Chemical Substance are major cause of accidents due to Lack of experience in usage, but not any other reason"],
         "context_set": ""
        },		 
		{"tag": "MiningTPRemoteEmployee",
         "patterns": ["What causes accidents in Metals of Third Party Remote employee type?",
					  "What are Major Reason of accidents in Metals?",
					  "Is Cooking Major Reason of Accidents in Mining TP Employee type?",
					  "Are many accidents caused by drilling?",
					  "Lack of experience in working with drill rod is major cause of accidents?",
					  "Are many accidents happening because of Hydraulic filling?",
					  "Are many accidents caused during installation of HDPE pipe?",
					  "Is dealing with Hot Water a major reason of accidents?",
					  "Failures in installation of transmission belts a major reason of Concern?"],
         "responses": ["In MiningTPRemoteEmployee type, drilling and Hose Pipe types are major cause of accidents due to Lack of experience in usage, but not any other reason"],
         "context_set": ""
        },		
		{"tag": "MiningTPEmployee",
         "patterns": ["What causes accidents in Metals of Third Party employee type?",
					  "What are Major Reason of accidents in MiningTPEmployee?",
					  "Are Vehicles and Mobile Equipment major reason of Accidents in MiningTPEmployee?",
					  "Are many accidents caused by Parking and Proceeding?",
					  "Is Projection of equipment a major cause of accidents?",
					  "Are many accidents happening because of Hydraulic filling?",
					  "Are many accidents caused during installation of HDPE pipe?",
					  "Is dealing with Hot Water a major reason of accidents?",
					  "Failures in installation of transmission belts a major reason of Concern?"],
         "responses": ["In MiningTPEmployee type, drilling and Hose Pipe types are major cause of accidents due to Lack of experience in usage, but not any other reason"],
         "context_set": ""
        },
		{"tag": "MetalsEmployee",
         "patterns": ["What are the issues realted to volumetric balloon?",
					  "Are major accidents realted to cyclone duct?",
					  "Are major accidents happened while cleaning the cyclone duct?",
					  "accidents happened while cleaning the cyclone duct",
					  "incidents happened while cleaning the cyclone duct",
					  "Are major accidents happened due to obstruction on Cyclone duct?",
					  "accidents happened due to obstruction on Cyclone duct",
					  "incidents happened due to obstruction on Cyclone duct",
					  "Are major accidents happened  due to accumulation of Waelz on the conveyor?",
					  "Are major accidents happened due to cleaning of the shutter?",
					  "Are major accidents happened related to zinc?",
					  "accidents happened related to zinc",
					  "incidents happened related to zinc",
					  "Are major accidents happened  realted Employee in metals industry?",
					  "Are major accidents happened in metals industry?",
					  "What are the issues realted to volumetric balloon",
					  "accident realted to volumetric balloon",
					  "accident realted to cyclone duct",
					  "issues realted to cyclone duct",
					  "issues while cleaning the cyclone duct",
					  "accidents while cleaning the cyclone duct",
					  "obstruction on Cyclone duct",
					  "accumulation of Waelz on the conveyor",
					  "issues related to cleaning of the shutter",
					  "related to zinc",
					  "accident realted Employee in metals industry",
					  "accidents in metals industry"
					  ],
         "responses": ["Volumetric balloon and cyclone duct and conveyor and Zinc Employees are major accidents which have result in small burns on the body parts including face as well. Proper training and Experience is required"],
		 "context_set": ""
        },
		{"tag": "OthersTPEmployee",
         "patterns": ["Are major accidents happened realted to cuts?",
					  "Are major accidents happened realted to Manetometer?",
					  "Are major accidents happened realted to Manetometer?",
					  "Are major accidents happened due to steep slope issues?",
					  "Are major accidents happened due to sleeve removal?",
					  "Are major accidents happened related to geological mapping activity?",
					  "Are major accidents happened related to vehicle?",
					  "Are major accidents happened related to hammer a rock",
					  "issues realted to cuts",
					  "issues realted to Manetometer",
					  "accidents with Manetometer",
					  "steep slope issues ",
					  "issues while doing sleeve removal",
					  "accidents causing cuts",
					  "geological mapping activity",
					  "realted to vehicle",
					  "hammer a rock"
					],
         "responses": [" Manetometer and sleeve removal maneuver and vehicle and geological mapping activity Third Party Employees in Other Industry are major accidents which have resulted in different degree of cuts due to which Employees have been Hospitalized as well. Recommended to take precautions and use covers while working on such areas"],
		 "context_set": ""
        },

        {"tag": "escalation",
         "patterns": ["my problem is not solved", 
                      "you did not help me", 
                      "not a good solution",
                      "bad solution",
                      "not good solution",
                      "no help",
                      "wasted my time",
                      "useless bot",
                      "create a ticket"],
         "responses": ["Apologies... Please restructure your question and ask again. You can also drop an email with your query to safexchatbot@gmail.com"],
         "context_set": ""
        }
    ]
}